const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21',() =>{
  expect(sum(20,1)).toBe(21);
});


// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7',() =>{
  expect(sum(2,5)).toBe(7);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
test('6 + 11 เท่ากับ 17',() =>{
  expect(sum(6,11)).toBe(17);
});

test('9 + 22 เท่ากับ 31',() =>{
  expect(sum(9,22)).toBe(31);
});

test('88 + 12 เท่ากับ 100',() =>{
  expect(sum(88,12)).toBe(100);
})